HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEray_regdef.h
/** \\brief  Message Buffer Status */
typedef struct _Ifx_ERAY_MBS_Bits
{
    unsigned int VFRA:1;                    /**< \brief [0:0] Valid Frame Received on Channel A (vSS!ValidFrameA) (rh) */
    unsigned int VFRB:1;                    /**< \brief [1:1] Valid Frame Received on Channel B (vSS!ValidFrameB) (rh) */
    unsigned int SEOA:1;                    /**< \brief [2:2] Syntax Error Observed on Channel A (vSS!SyntaxErrorA) (rh) */
    unsigned int SEOB:1;                    /**< \brief [3:3] Syntax Error Observed on Channel B (vSS!SyntaxErrorB) (rh) */
    unsigned int CEOA:1;                    /**< \brief [4:4] Content Error Observed on Channel A (vSS!ContentErrorA) (rh) */
    unsigned int CEOB:1;                    /**< \brief [5:5] Content Error Observed on Channel B (vSS!ContentErrorB) (rh) */
    unsigned int SVOA:1;                    /**< \brief [6:6] Slot Boundary Violation Observed on Channel A (vSS!BViolationA) (rh) */
    unsigned int SVOB:1;                    /**< \brief [7:7] Slot Boundary Violation Observed on Channel B (vSS!BViolationB) (rh) */
    unsigned int TCIA:1;                    /**< \brief [8:8] Transmission Conflict Indication Channel A (vSS!TxConflictA) (rh) */
    unsigned int TCIB:1;                    /**< \brief [9:9] Transmission Conflict Indication Channel B (vSS!TxConflictB) (rh) */
    unsigned int ESA:1;                     /**< \brief [10:10] Empty Slot Channel A (rh) */
    unsigned int ESB:1;                     /**< \brief [11:11] Empty Slot Channel B (rh) */
    unsigned int MLST:1;                    /**< \brief [12:12] Message Lost (rh) */
    unsigned int reserved_13:1;             /**< \brief \internal Reserved */
    unsigned int FTA:1;                     /**< \brief [14:14] Frame Transmitted on Channel A (rh) */
    unsigned int FTB:1;                     /**< \brief [15:15] Frame Transmitted on Channel B (rh) */
    unsigned int CCS:6;                     /**< \brief [21:16] Cycle Count Status (rh) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int RCIS:1;                    /**< \brief [24:24] Received on Channel Indicator Status (vSS!Channel) (rh) */
    unsigned int SFIS:1;                    /**< \brief [25:25] Startup Frame Indicator Status (vRF!Header!SuFIndicator) (rh) */
    unsigned int SYNS:1;                    /**< \brief [26:26] SYNC Frame Indicator Status (vRF!Header!SyFIndicator) (rh) */
    unsigned int NFIS:1;                    /**< \brief [27:27] NULL Frame Indicator Status (vRF!Header!NFIndicator) (rh) */
    unsigned int PPIS:1;                    /**< \brief [28:28] Payload Preamble Indictor Status (vRF!Header!PPIndicator) (rh) */
    unsigned int RESS:1;                    /**< \brief [29:29] Reserved Bit Status (vRF!Header!Reserved) (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_MBS_Bits;

/** \\brief  Message Buffer Status Changed 1 */
typedef struct _Ifx_ERAY_MBSC1_Bits
{
    unsigned int MBC0:1;                    /**< \brief [0:0] Message Buffer Status Changed 0 (0 = 0-31) (rh) */
    unsigned int MBC1:1;                    /**< \brief [1:1] Message Buffer Status Changed 1 (1 = 0-31) (rh) */
    unsigned int MBC2:1;                    /**< \brief [2:2] Message Buffer Status Changed 2 (2 = 0-31) (rh) */
    unsigned int MBC3:1;                    /**< \brief [3:3] Message Buffer Status Changed 3 (3 = 0-31) (rh) */
    unsigned int MBC4:1;                    /**< \brief [4:4] Message Buffer Status Changed 4 (4 = 0-31) (rh) */
    unsigned int MBC5:1;                    /**< \brief [5:5] Message Buffer Status Changed 5 (5 = 0-31) (rh) */
    unsigned int MBC6:1;                    /**< \brief [6:6] Message Buffer Status Changed 6 (6 = 0-31) (rh) */
    unsigned int MBC7:1;                    /**< \brief [7:7] Message Buffer Status Changed 7 (7 = 0-31) (rh) */
    unsigned int MBC8:1;                    /**< \brief [8:8] Message Buffer Status Changed 8 (8 = 0-31) (rh) */
    unsigned int MBC9:1;                    /**< \brief [9:9] Message Buffer Status Changed 9 (9 = 0-31) (rh) */
    unsigned int MBC10:1;                   /**< \brief [10:10] Message Buffer Status Changed 10 (10 = 0-31) (rh) */
    unsigned int MBC11:1;                   /**< \brief [11:11] Message Buffer Status Changed 11 (11 = 0-31) (rh) */
    unsigned int MBC12:1;                   /**< \brief [12:12] Message Buffer Status Changed 12 (12 = 0-31) (rh) */
    unsigned int MBC13:1;                   /**< \brief [13:13] Message Buffer Status Changed 13 (13 = 0-31) (rh) */
    unsigned int MBC14:1;                   /**< \brief [14:14] Message Buffer Status Changed 14 (14 = 0-31) (rh) */
    unsigned int MBC15:1;                   /**< \brief [15:15] Message Buffer Status Changed 15 (15 = 0-31) (rh) */
    unsigned int MBC16:1;                   /**< \brief [16:16] Message Buffer Status Changed 16 (16 = 0-31) (rh) */
    unsigned int MBC17:1;                   /**< \brief [17:17] Message Buffer Status Changed 17 (17 = 0-31) (rh) */
    unsigned int MBC18:1;                   /**< \brief [18:18] Message Buffer Status Changed 18 (18 = 0-31) (rh) */
    unsigned int MBC19:1;                   /**< \brief [19:19] Message Buffer Status Changed 19 (19 = 0-31) (rh) */
    unsigned int MBC20:1;                   /**< \brief [20:20] Message Buffer Status Changed 20 (20 = 0-31) (rh) */
    unsigned int MBC21:1;                   /**< \brief [21:21] Message Buffer Status Changed 21 (21 = 0-31) (rh) */
    unsigned int MBC22:1;                   /**< \brief [22:22] Message Buffer Status Changed 22 (22 = 0-31) (rh) */
    unsigned int MBC23:1;                   /**< \brief [23:23] Message Buffer Status Changed 23 (23 = 0-31) (rh) */
    unsigned int MBC24:1;                   /**< \brief [24:24] Message Buffer Status Changed 24 (24 = 0-31) (rh) */
    unsigned int MBC25:1;                   /**< \brief [25:25] Message Buffer Status Changed 25 (25 = 0-31) (rh) */
    unsigned int MBC26:1;                   /**< \brief [26:26] Message Buffer Status Changed 26 (26 = 0-31) (rh) */
    unsigned int MBC27:1;                   /**< \brief [27:27] Message Buffer Status Changed 27 (27 = 0-31) (rh) */
    unsigned int MBC28:1;                   /**< \brief [28:28] Message Buffer Status Changed 28 (28 = 0-31) (rh) */
    unsigned int MBC29:1;                   /**< \brief [29:29] Message Buffer Status Changed 29 (29 = 0-31) (rh) */
    unsigned int MBC30:1;                   /**< \brief [30:30] Message Buffer Status Changed 30 (30 = 0-31) (rh) */
    unsigned int MBC31:1;                   /**< \brief [31:31] Message Buffer Status Changed 31 (31 = 0-31) (rh) */
} Ifx_ERAY_MBSC1_Bits;

/** \\brief  Message Buffer Status Changed 2 */
typedef struct _Ifx_ERAY_MBSC2_Bits
{
    unsigned int MBC32:1;                   /**< \brief [0:0] Message Buffer Status Changed 32 (32 = 32-63) (rh) */
    unsigned int MBC33:1;                   /**< \brief [1:1] Message Buffer Status Changed 33 (33 = 32-63) (rh) */
    unsigned int MBC34:1;                   /**< \brief [2:2] Message Buffer Status Changed 34 (34 = 32-63) (rh) */
    unsigned int MBC35:1;                   /**< \brief [3:3] Message Buffer Status Changed 35 (35 = 32-63) (rh) */
    unsigned int MBC36:1;                   /**< \brief [4:4] Message Buffer Status Changed 36 (36 = 32-63) (rh) */
    unsigned int MBC37:1;                   /**< \brief [5:5] Message Buffer Status Changed 37 (37 = 32-63) (rh) */
    unsigned int MBC38:1;                   /**< \brief [6:6] Message Buffer Status Changed 38 (38 = 32-63) (rh) */
    unsigned int MBC39:1;                   /**< \brief [7:7] Message Buffer Status Changed 39 (39 = 32-63) (rh) */
    unsigned int MBC40:1;                   /**< \brief [8:8] Message Buffer Status Changed 40 (40 = 32-63) (rh) */
    unsigned int MBC41:1;                   /**< \brief [9:9] Message Buffer Status Changed 41 (41 = 32-63) (rh) */
    unsigned int MBC42:1;                   /**< \brief [10:10] Message Buffer Status Changed 42 (42 = 32-63) (rh) */
    unsigned int MBC43:1;                   /**< \brief [11:11] Message Buffer Status Changed 43 (43 = 32-63) (rh) */
    unsigned int MBC44:1;                   /**< \brief [12:12] Message Buffer Status Changed 44 (44 = 32-63) (rh) */
    unsigned int MBC45:1;                   /**< \brief [13:13] Message Buffer Status Changed 45 (45 = 32-63) (rh) */
    unsigned int MBC46:1;                   /**< \brief [14:14] Message Buffer Status Changed 46 (46 = 32-63) (rh) */
    unsigned int MBC47:1;                   /**< \brief [15:15] Message Buffer Status Changed 47 (47 = 32-63) (rh) */
    unsigned int MBC48:1;                   /**< \brief [16:16] Message Buffer Status Changed 48 (48 = 32-63) (rh) */
    unsigned int MBC49:1;                   /**< \brief [17:17] Message Buffer Status Changed 49 (49 = 32-63) (rh) */
    unsigned int MBC50:1;                   /**< \brief [18:18] Message Buffer Status Changed 50 (50 = 32-63) (rh) */
    unsigned int MBC51:1;                   /**< \brief [19:19] Message Buffer Status Changed 51 (51 = 32-63) (rh) */
    unsigned int MBC52:1;                   /**< \brief [20:20] Message Buffer Status Changed 52 (52 = 32-63) (rh) */
    unsigned int MBC53:1;                   /**< \brief [21:21] Message Buffer Status Changed 53 (53 = 32-63) (rh) */
    unsigned int MBC54:1;                   /**< \brief [22:22] Message Buffer Status Changed 54 (54 = 32-63) (rh) */
    unsigned int MBC55:1;                   /**< \brief [23:23] Message Buffer Status Changed 55 (55 = 32-63) (rh) */
    unsigned int MBC56:1;                   /**< \brief [24:24] Message Buffer Status Changed 56 (56 = 32-63) (rh) */
    unsigned int MBC57:1;                   /**< \brief [25:25] Message Buffer Status Changed 57 (57 = 32-63) (rh) */
    unsigned int MBC58:1;                   /**< \brief [26:26] Message Buffer Status Changed 58 (58 = 32-63) (rh) */
    unsigned int MBC59:1;                   /**< \brief [27:27] Message Buffer Status Changed 59 (59 = 32-63) (rh) */
    unsigned int MBC60:1;                   /**< \brief [28:28] Message Buffer Status Changed 60 (60 = 32-63) (rh) */
    unsigned int MBC61:1;                   /**< \brief [29:29] Message Buffer Status Changed 61 (61 = 32-63) (rh) */
    unsigned int MBC62:1;                   /**< \brief [30:30] Message Buffer Status Changed 62 (62 = 32-63) (rh) */
    unsigned int MBC63:1;                   /**< \brief [31:31] Message Buffer Status Changed 63 (63 = 32-63) (rh) */
} Ifx_ERAY_MBSC2_Bits;

