HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEray_regdef.h
/** \\brief  Slot Counter Value */
typedef struct _Ifx_ERAY_SCV_Bits
{
    unsigned int SCCA:11;                   /**< \brief [10:0] Slot Counter Channel A (vSlotCounter[A]) (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int SCCB:11;                   /**< \brief [26:16] Slot Counter Channel B (vSlotCounter[B]) (rh) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_SCV_Bits;

/** \\brief  SYNC Frame Status */
typedef struct _Ifx_ERAY_SFS_Bits
{
    unsigned int VSAE:4;                    /**< \brief [3:0] Valid SYNC Frames Channel A, even communication cycle (rh) */
    unsigned int VSAO:4;                    /**< \brief [7:4] Valid SYNC Frames Channel A, odd communication cycle (rh) */
    unsigned int VSBE:4;                    /**< \brief [11:8] Valid SYNC Frames Channel B, even communication cycle (rh) */
    unsigned int VSBO:4;                    /**< \brief [15:12] Valid SYNC Frames Channel B, odd communication cycle (rh) */
    unsigned int MOCS:1;                    /**< \brief [16:16] Missing Offset Correction Signal (rh) */
    unsigned int OCLR:1;                    /**< \brief [17:17] Offset Correction Limit Reached (rh) */
    unsigned int MRCS:1;                    /**< \brief [18:18] Missing Rate Correction Signal (rh) */
    unsigned int RCLR:1;                    /**< \brief [19:19] Rate Correction Limit Reached (rh) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_ERAY_SFS_Bits;

/** \\brief  Status Service Request Enable Reset */
typedef struct _Ifx_ERAY_SIER_Bits
{
    unsigned int WSTE:1;                    /**< \brief [0:0] Wakeup Status Service Request Enable (rwh) */
    unsigned int CASE:1;                    /**< \brief [1:1] Collision Avoidance Symbol Service Request Enable (rwh) */
    unsigned int CYCSE:1;                   /**< \brief [2:2] Cycle Start Service Request Enable (rwh) */
    unsigned int TXIE:1;                    /**< \brief [3:3] Transmit Service Request Enable (rwh) */
    unsigned int RXIE:1;                    /**< \brief [4:4] Receive Service Request Enable (rwh) */
    unsigned int RFNEE:1;                   /**< \brief [5:5] Receive FIFO Not Empty Service Request Enable (rwh) */
    unsigned int RFCLE:1;                   /**< \brief [6:6] Receive FIFO Critical Level Service Request Enable (rwh) */
    unsigned int NMVCE:1;                   /**< \brief [7:7] Network Management Vector Changed Service Request Enable (rwh) */
    unsigned int TI0E:1;                    /**< \brief [8:8] Timer Service Request 0 Enable (rwh) */
    unsigned int TI1E:1;                    /**< \brief [9:9] Timer Service Request 1 Enable (rwh) */
    unsigned int TIBCE:1;                   /**< \brief [10:10] Transfer Input Buffer Completed Service Request Enable (rwh) */
    unsigned int TOBCE:1;                   /**< \brief [11:11] Transfer Output Buffer Completed Service Request Enable (rwh) */
    unsigned int SWEE:1;                    /**< \brief [12:12] Stop Watch Event Service Request Enable (rwh) */
    unsigned int SUCSE:1;                   /**< \brief [13:13] Startup Completed Successfully Service Request Enable (rwh) */
    unsigned int MBSIE:1;                   /**< \brief [14:14] Message Buffer Status Service Request Enable (rwh) */
    unsigned int SDSE:1;                    /**< \brief [15:15] Start of Dynamic Segment Service Request Enable (rwh) */
    unsigned int WUPAE:1;                   /**< \brief [16:16] Wakeup Pattern Channel A Service Request Enable (rwh) */
    unsigned int MTSAE:1;                   /**< \brief [17:17] Media Access Test Symbol Channel A Service Request Enable (rwh) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int WUPBE:1;                   /**< \brief [24:24] Wakeup Pattern Channel B Service Request Enable (rwh) */
    unsigned int MTSBE:1;                   /**< \brief [25:25] Media Access Test Symbol Channel B Service Request Enable (rwh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ERAY_SIER_Bits;

/** \\brief  Status Service Request Enable Set */
typedef struct _Ifx_ERAY_SIES_Bits
{
    unsigned int WSTE:1;                    /**< \brief [0:0] Wakeup Status Service Request Enable (rwh) */
    unsigned int CASE:1;                    /**< \brief [1:1] Collision Avoidance Symbol Service Request Enable (rwh) */
    unsigned int CYCSE:1;                   /**< \brief [2:2] Cycle Start Service Request Enable (rwh) */
    unsigned int TXIE:1;                    /**< \brief [3:3] Transmit Service Request Enable (rwh) */
    unsigned int RXIE:1;                    /**< \brief [4:4] Receive Service Request Enable (rwh) */
    unsigned int RFNEE:1;                   /**< \brief [5:5] Receive FIFO Not Empty Service Request Enable (rwh) */
    unsigned int RFCLE:1;                   /**< \brief [6:6] Receive FIFO Critical Level Service Request Enable (rwh) */
    unsigned int NMVCE:1;                   /**< \brief [7:7] Network Management Vector Changed Service Request Enable (rwh) */
    unsigned int TI0E:1;                    /**< \brief [8:8] Timer Service Request 0 Enable (rwh) */
    unsigned int TI1E:1;                    /**< \brief [9:9] Timer Service Request 1 Enable (rwh) */
    unsigned int TIBCE:1;                   /**< \brief [10:10] Transfer Input Buffer Completed Service Request Enable (rwh) */
    unsigned int TOBCE:1;                   /**< \brief [11:11] Transfer Output Buffer Completed Service Request Enable (rwh) */
    unsigned int SWEE:1;                    /**< \brief [12:12] Stop Watch Event Service Request Enable (rwh) */
    unsigned int SUCSE:1;                   /**< \brief [13:13] Startup Completed Successfully Service Request Enable (rwh) */
    unsigned int MBSIE:1;                   /**< \brief [14:14] Message Buffer Status Service Request Enable (rwh) */
    unsigned int SDSE:1;                    /**< \brief [15:15] Start of Dynamic Segment Service Request Enable (rwh) */
    unsigned int WUPAE:1;                   /**< \brief [16:16] Wakeup Pattern Channel A Service Request Enable (rwh) */
    unsigned int MTSAE:1;                   /**< \brief [17:17] Media Access Test Symbol Channel A Service Request Enable (rwh) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int WUPBE:1;                   /**< \brief [24:24] Wakeup Pattern Channel B Service Request Enable (rwh) */
    unsigned int MTSBE:1;                   /**< \brief [25:25] Media Access Test Symbol Channel B Service Request Enable (rwh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ERAY_SIES_Bits;

/** \\brief  Status Service Request Line Select */
typedef struct _Ifx_ERAY_SILS_Bits
{
    unsigned int WSTL:1;                    /**< \brief [0:0] Wakeup Status Service Request Line (rw) */
    unsigned int CASL:1;                    /**< \brief [1:1] Collision Avoidance Symbol Service Request Line (rw) */
    unsigned int CYCSL:1;                   /**< \brief [2:2] Cycle Start Service Request Line (rw) */
    unsigned int TXIL:1;                    /**< \brief [3:3] Transmit Service Request Line (rw) */
    unsigned int RXIL:1;                    /**< \brief [4:4] Receive Service Request Line (rw) */
    unsigned int RFNEL:1;                   /**< \brief [5:5] Receive FIFO Not Empty Service Request Line (rw) */
    unsigned int RFCLL:1;                   /**< \brief [6:6] Receive FIFO Critical Level Service Request Line (rw) */
    unsigned int NMVCL:1;                   /**< \brief [7:7] Network Management Vector Changed Service Request Line (rw) */
    unsigned int TI0L:1;                    /**< \brief [8:8] Timer Service Request 0 Line (rw) */
    unsigned int TI1L:1;                    /**< \brief [9:9] Timer Service Request 1 Line (rw) */
    unsigned int TIBCL:1;                   /**< \brief [10:10] Transfer Input Buffer Completed Service Request Line (rw) */
    unsigned int TOBCL:1;                   /**< \brief [11:11] Transfer Output Buffer Completed Service Request Line (rw) */
    unsigned int SWEL:1;                    /**< \brief [12:12] Stop Watch Event Service Request Line (rw) */
    unsigned int SUCSL:1;                   /**< \brief [13:13] Startup Completed Successfully Service Request Line (rw) */
    unsigned int MBSIL:1;                   /**< \brief [14:14] Message Buffer Status Service Request Line (rw) */
    unsigned int SDSL:1;                    /**< \brief [15:15] Start of Dynamic Segment Service Request Line (rw) */
    unsigned int WUPAL:1;                   /**< \brief [16:16] Wakeup Pattern Channel A Service Request Line (rw) */
    unsigned int MTSAL:1;                   /**< \brief [17:17] Media Access Test Symbol Channel A Service Request Line (rw) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int WUPBL:1;                   /**< \brief [24:24] Wakeup Pattern Channel B Service Request Line (rw) */
    unsigned int MTSBL:1;                   /**< \brief [25:25] Media Access Test Symbol Channel B Service Request Line (rw) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ERAY_SILS_Bits;

