HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEray_regdef.h
/** \\brief  Aggregated Channel Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_ACS_Bits B;
} Ifx_ERAY_ACS;

/** \\brief  Communication Controller Error Vector */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_CCEV_Bits B;
} Ifx_ERAY_CCEV;

/** \\brief  Communication Controller Status Vector */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_CCSV_Bits B;
} Ifx_ERAY_CCSV;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_CLC_Bits B;
} Ifx_ERAY_CLC;

/** \\brief  Core Release Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_CREL_Bits B;
} Ifx_ERAY_CREL;

/** \\brief  Busy and Input Buffer Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_CUST1_Bits B;
} Ifx_ERAY_CUST1;

/** \\brief  Customer Interface Timeout Counter */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_CUST3_Bits B;
} Ifx_ERAY_CUST3;

/** \\brief  Error Service Request Enable Reset */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_EIER_Bits B;
} Ifx_ERAY_EIER;

/** \\brief  Error Service Request Enable Set */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_EIES_Bits B;
} Ifx_ERAY_EIES;

/** \\brief  Error Service Request Line Select */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_EILS_Bits B;
} Ifx_ERAY_EILS;

/** \\brief  Error Service Request Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_EIR_Bits B;
} Ifx_ERAY_EIR;

/** \\brief  Endian Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_ENDN_Bits B;
} Ifx_ERAY_ENDN;

/** \\brief  Even Sync ID Symbol Window */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_ESID_Bits B;
} Ifx_ERAY_ESID;

/** \\brief  FIFO Critical Level */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_FCL_Bits B;
} Ifx_ERAY_FCL;

/** \\brief  FIFO Rejection Filter */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_FRF_Bits B;
} Ifx_ERAY_FRF;

/** \\brief  FIFO Rejection Filter Mask */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_FRFM_Bits B;
} Ifx_ERAY_FRFM;

/** \\brief  FIFO Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_FSR_Bits B;
} Ifx_ERAY_FSR;

/** \\brief  GTU Configuration Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC01_Bits B;
} Ifx_ERAY_GTUC01;

/** \\brief  GTU Configuration Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC02_Bits B;
} Ifx_ERAY_GTUC02;

/** \\brief  GTU Configuration Register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC03_Bits B;
} Ifx_ERAY_GTUC03;

/** \\brief  GTU Configuration Register 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC04_Bits B;
} Ifx_ERAY_GTUC04;

/** \\brief  GTU Configuration Register 5 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC05_Bits B;
} Ifx_ERAY_GTUC05;

/** \\brief  GTU Configuration Register 6 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC06_Bits B;
} Ifx_ERAY_GTUC06;

/** \\brief  GTU Configuration Register 7 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC07_Bits B;
} Ifx_ERAY_GTUC07;

/** \\brief  GTU Configuration Register 8 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC08_Bits B;
} Ifx_ERAY_GTUC08;

/** \\brief  GTU Configuration Register 9 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC09_Bits B;
} Ifx_ERAY_GTUC09;

/** \\brief  GTU Configuration Register 10 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC10_Bits B;
} Ifx_ERAY_GTUC10;

/** \\brief  GTU Configuration Register 11 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_GTUC11_Bits B;
} Ifx_ERAY_GTUC11;

/** \\brief  Input Buffer Command Mask */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_IBCM_Bits B;
} Ifx_ERAY_IBCM;

/** \\brief  Input Buffer Command Request */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_IBCR_Bits B;
} Ifx_ERAY_IBCR;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_ID_Bits B;
} Ifx_ERAY_ID;

/** \\brief  Service Request Line Enable */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_ILE_Bits B;
} Ifx_ERAY_ILE;

/** \\brief  Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_KRST0_Bits B;
} Ifx_ERAY_KRST0;

/** \\brief  Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_KRST1_Bits B;
} Ifx_ERAY_KRST1;

/** \\brief  Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_KRSTCLR_Bits B;
} Ifx_ERAY_KRSTCLR;

/** \\brief  Lock Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_LCK_Bits B;
} Ifx_ERAY_LCK;

/** \\brief  Last Dynamic Transmit Slot */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_LDTS_Bits B;
} Ifx_ERAY_LDTS;

