HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxEray_regdef.h
/** \\brief  Transmission Request Register 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_TXRQ2_Bits B;
} Ifx_ERAY_TXRQ2;

/** \\brief  Transmission Request Register 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_TXRQ3_Bits B;
} Ifx_ERAY_TXRQ3;

/** \\brief  Transmission Request Register 4 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_TXRQ4_Bits B;
} Ifx_ERAY_TXRQ4;

/** \\brief  Write Data Section */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_WRDS_Bits B;
} Ifx_ERAY_WRDS;

/** \\brief  Write Header Section 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_WRHS1_Bits B;
} Ifx_ERAY_WRHS1;

/** \\brief  Write Header Section 2 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_WRHS2_Bits B;
} Ifx_ERAY_WRHS2;

/** \\brief  Write Header Section 3 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_ERAY_WRHS3_Bits B;
} Ifx_ERAY_WRHS3;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Eray_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  ERAY object */
typedef volatile struct _Ifx_ERAY
{
    Ifx_ERAY_CLC CLC;                       /**< \brief 0, Clock Control Register */
    Ifx_ERAY_CUST1 CUST1;                   /**< \brief 4, Busy and Input Buffer Control Register */
    Ifx_ERAY_ID ID;                         /**< \brief 8, Module Identification Register */
    Ifx_ERAY_CUST3 CUST3;                   /**< \brief C, Customer Interface Timeout Counter */
    Ifx_ERAY_TEST1 TEST1;                   /**< \brief 10, Test Register 1 */
    Ifx_ERAY_TEST2 TEST2;                   /**< \brief 14, Test Register 2 */
    unsigned char reserved_18[4];           /**< \brief 18, \internal Reserved */
    Ifx_ERAY_LCK LCK;                       /**< \brief 1C, Lock Register */
    Ifx_ERAY_EIR EIR;                       /**< \brief 20, Error Service Request Register */
    Ifx_ERAY_SIR SIR;                       /**< \brief 24, Status Service Request Register */
    Ifx_ERAY_EILS EILS;                     /**< \brief 28, Error Service Request Line Select */
    Ifx_ERAY_SILS SILS;                     /**< \brief 2C, Status Service Request Line Select */
    Ifx_ERAY_EIES EIES;                     /**< \brief 30, Error Service Request Enable Set */
    Ifx_ERAY_EIER EIER;                     /**< \brief 34, Error Service Request Enable Reset */
    Ifx_ERAY_SIES SIES;                     /**< \brief 38, Status Service Request Enable Set */
    Ifx_ERAY_SIER SIER;                     /**< \brief 3C, Status Service Request Enable Reset */
    Ifx_ERAY_ILE ILE;                       /**< \brief 40, Service Request Line Enable */
    Ifx_ERAY_T0C T0C;                       /**< \brief 44, Timer 0 Configuration */
    Ifx_ERAY_T1C T1C;                       /**< \brief 48, Timer 1 Configuration */
    Ifx_ERAY_STPW1 STPW1;                   /**< \brief 4C, Stop Watch Register 1 */
    Ifx_ERAY_STPW2 STPW2;                   /**< \brief 50, Stop Watch Register 2 */
    unsigned char reserved_54[44];          /**< \brief 54, \internal Reserved */
    Ifx_ERAY_SUCC1 SUCC1;                   /**< \brief 80, SUC Configuration Register 1 */
    Ifx_ERAY_SUCC2 SUCC2;                   /**< \brief 84, SUC Configuration Register 2 */
    Ifx_ERAY_SUCC3 SUCC3;                   /**< \brief 88, SUC Configuration Register 3 */
    Ifx_ERAY_NEMC NEMC;                     /**< \brief 8C, NEM Configuration Register */
    Ifx_ERAY_PRTC1 PRTC1;                   /**< \brief 90, PRT Configuration Register 1 */
    Ifx_ERAY_PRTC2 PRTC2;                   /**< \brief 94, PRT Configuration Register 2 */
    Ifx_ERAY_MHDC MHDC;                     /**< \brief 98, MHD Configuration Register */
    unsigned char reserved_9C[4];           /**< \brief 9C, \internal Reserved */
    Ifx_ERAY_GTUC01 GTUC01;                 /**< \brief A0, GTU Configuration Register 1 */
    Ifx_ERAY_GTUC02 GTUC02;                 /**< \brief A4, GTU Configuration Register 2 */
    Ifx_ERAY_GTUC03 GTUC03;                 /**< \brief A8, GTU Configuration Register 3 */
    Ifx_ERAY_GTUC04 GTUC04;                 /**< \brief AC, GTU Configuration Register 4 */
    Ifx_ERAY_GTUC05 GTUC05;                 /**< \brief B0, GTU Configuration Register 5 */
    Ifx_ERAY_GTUC06 GTUC06;                 /**< \brief B4, GTU Configuration Register 6 */
    Ifx_ERAY_GTUC07 GTUC07;                 /**< \brief B8, GTU Configuration Register 7 */
    Ifx_ERAY_GTUC08 GTUC08;                 /**< \brief BC, GTU Configuration Register 8 */
    Ifx_ERAY_GTUC09 GTUC09;                 /**< \brief C0, GTU Configuration Register 9 */
    Ifx_ERAY_GTUC10 GTUC10;                 /**< \brief C4, GTU Configuration Register 10 */
    Ifx_ERAY_GTUC11 GTUC11;                 /**< \brief C8, GTU Configuration Register 11 */
    unsigned char reserved_CC[52];          /**< \brief CC, \internal Reserved */
    Ifx_ERAY_CCSV CCSV;                     /**< \brief 100, Communication Controller Status Vector */
    Ifx_ERAY_CCEV CCEV;                     /**< \brief 104, Communication Controller Error Vector */
    unsigned char reserved_108[8];          /**< \brief 108, \internal Reserved */
    Ifx_ERAY_SCV SCV;                       /**< \brief 110, Slot Counter Value */
    Ifx_ERAY_MTCCV MTCCV;                   /**< \brief 114, Macrotick and Cycle Counter Value */
    Ifx_ERAY_RCV RCV;                       /**< \brief 118, Rate Correction Value */
    Ifx_ERAY_OCV OCV;                       /**< \brief 11C, Offset Correction Value */
    Ifx_ERAY_SFS SFS;                       /**< \brief 120, SYNC Frame Status */
    Ifx_ERAY_SWNIT SWNIT;                   /**< \brief 124, Symbol Window and Network Idle Time Status */
    Ifx_ERAY_ACS ACS;                       /**< \brief 128, Aggregated Channel Status */
    unsigned char reserved_12C[4];          /**< \brief 12C, \internal Reserved */
    Ifx_ERAY_ESID ESID_1S[15];              /**< \brief 130, Even Sync ID Symbol Window \note Array index shifted by 1. Example: defined register ESID_1S[0]/ESID_1S0 corresponds to user manual ESID_1S1, ... */
    unsigned char reserved_16C[4];          /**< \brief 16C, \internal Reserved */
    Ifx_ERAY_OSID OSID_1S[15];              /**< \brief 170, Odd Sync ID Symbol Window \note Array index shifted by 1. Example: defined register OSID_1S[0]/OSID_1S0 corresponds to user manual OSID_1S1, ... */
    unsigned char reserved_1AC[4];          /**< \brief 1AC, \internal Reserved */
    Ifx_ERAY_NMV NMV_1S[3];                 /**< \brief 1B0, Network Management Vector \note Array index shifted by 1. Example: defined register NMV_1S[0]/NMV_1S0 corresponds to user manual NMV_1S1, ... */
    unsigned char reserved_1BC[324];        /**< \brief 1BC, \internal Reserved */
    Ifx_ERAY_MRC MRC;                       /**< \brief 300, Message RAM Configuration */
    Ifx_ERAY_FRF FRF;                       /**< \brief 304, FIFO Rejection Filter */
    Ifx_ERAY_FRFM FRFM;                     /**< \brief 308, FIFO Rejection Filter Mask */
    Ifx_ERAY_FCL FCL;                       /**< \brief 30C, FIFO Critical Level */
    Ifx_ERAY_MHDS MHDS;                     /**< \brief 310, Message Handler Status */
    Ifx_ERAY_LDTS LDTS;                     /**< \brief 314, Last Dynamic Transmit Slot */
    Ifx_ERAY_FSR FSR;                       /**< \brief 318, FIFO Status Register */
    Ifx_ERAY_MHDF MHDF;                     /**< \brief 31C, Message Handler Constraints Flags */
    Ifx_ERAY_TXRQ1 TXRQ1;                   /**< \brief 320, Transmission Request Register 1 */
    Ifx_ERAY_TXRQ2 TXRQ2;                   /**< \brief 324, Transmission Request Register 2 */
    Ifx_ERAY_TXRQ3 TXRQ3;                   /**< \brief 328, Transmission Request Register 3 */
    Ifx_ERAY_TXRQ4 TXRQ4;                   /**< \brief 32C, Transmission Request Register 4 */
    Ifx_ERAY_NDAT1 NDAT1;                   /**< \brief 330, New Data Register 1 */
    Ifx_ERAY_NDAT2 NDAT2;                   /**< \brief 334, New Data Register 2 */
    Ifx_ERAY_NDAT3 NDAT3;                   /**< \brief 338, New Data Register 3 */
    Ifx_ERAY_NDAT4 NDAT4;                   /**< \brief 33C, New Data Register 4 */
    Ifx_ERAY_MBSC1 MBSC1;                   /**< \brief 340, Message Buffer Status Changed 1 */
    Ifx_ERAY_MBSC2 MBSC2;                   /**< \brief 344, Message Buffer Status Changed 2 */
    Ifx_ERAY_MBSC3 MBSC3;                   /**< \brief 348, Message Buffer Status Changed 3 */
    Ifx_ERAY_MBSC4 MBSC4;                   /**< \brief 34C, Message Buffer Status Changed 4 */
    unsigned char reserved_350[88];         /**< \brief 350, \internal Reserved */
    Ifx_ERAY_NDIC1 NDIC1;                   /**< \brief 3A8, New Data Interrupt Control 1 */
    Ifx_ERAY_NDIC2 NDIC2;                   /**< \brief 3AC, New Data Interrupt Control 2 */
    Ifx_ERAY_NDIC3 NDIC3;                   /**< \brief 3B0, New Data Interrupt Control 3 */
    Ifx_ERAY_NDIC4 NDIC4;                   /**< \brief 3B4, New Data Interrupt Control 4 */
    Ifx_ERAY_MSIC1 MSIC1;                   /**< \brief 3B8, Message Buffer Status Changed Interrupt Control 1 */
    Ifx_ERAY_MSIC2 MSIC2;                   /**< \brief 3BC, Message Buffer Status Changed Interrupt Control 2 */
    Ifx_ERAY_MSIC3 MSIC3;                   /**< \brief 3C0, Message Buffer Status Changed Interrupt Control 3 */
    Ifx_ERAY_MSIC4 MSIC4;                   /**< \brief 3C4, Message Buffer Status Changed Interrupt Control 4 */
    unsigned char reserved_3C8[40];         /**< \brief 3C8, \internal Reserved */
    Ifx_ERAY_CREL CREL;                     /**< \brief 3F0, Core Release Register */
    Ifx_ERAY_ENDN ENDN;                     /**< \brief 3F4, Endian Register */
    unsigned char reserved_3F8[8];          /**< \brief 3F8, \internal Reserved */
    Ifx_ERAY_WRDS WRDS_1S[64];              /**< \brief 400, Write Data Section \note Array index shifted by 1. Example: defined register WRDS_1S[0]/WRDS_1S0 corresponds to user manual WRDS_1S1, ... */
    Ifx_ERAY_WRHS1 WRHS1;                   /**< \brief 500, Write Header Section 1 */
    Ifx_ERAY_WRHS2 WRHS2;                   /**< \brief 504, Write Header Section 2 */
    Ifx_ERAY_WRHS3 WRHS3;                   /**< \brief 508, Write Header Section 3 */
    unsigned char reserved_50C[4];          /**< \brief 50C, \internal Reserved */
    Ifx_ERAY_IBCM IBCM;                     /**< \brief 510, Input Buffer Command Mask */
    Ifx_ERAY_IBCR IBCR;                     /**< \brief 514, Input Buffer Command Request */
    unsigned char reserved_518[232];        /**< \brief 518, \internal Reserved */
    Ifx_ERAY_RDDS RDDS_1S[64];              /**< \brief 600, Read Data Section \note Array index shifted by 1. Example: defined register RDDS_1S[0]/RDDS_1S0 corresponds to user manual RDDS_1S1, ... */
    Ifx_ERAY_RDHS1 RDHS1;                   /**< \brief 700, Read Header Section 1 */
    Ifx_ERAY_RDHS2 RDHS2;                   /**< \brief 704, Read Header Section 2 */
    Ifx_ERAY_RDHS3 RDHS3;                   /**< \brief 708, Read Header Section 3 */
    Ifx_ERAY_MBS MBS;                       /**< \brief 70C, Message Buffer Status */
    Ifx_ERAY_OBCM OBCM;                     /**< \brief 710, Output Buffer Command Mask */
    Ifx_ERAY_OBCR OBCR;                     /**< \brief 714, Output Buffer Command Request */
    unsigned char reserved_718[344];        /**< \brief 718, \internal Reserved */
    Ifx_ERAY_OTSS OTSS;                     /**< \brief 870, OCDS Trigger Set Select */
    unsigned char reserved_874[116];        /**< \brief 874, \internal Reserved */
    Ifx_ERAY_OCS OCS;                       /**< \brief 8E8, OCDS Control and Status */
    Ifx_ERAY_KRSTCLR KRSTCLR;               /**< \brief 8EC, Kernel Reset Status Clear Register */
    Ifx_ERAY_KRST1 KRST1;                   /**< \brief 8F0, Kernel Reset Register 1 */
    Ifx_ERAY_KRST0 KRST0;                   /**< \brief 8F4, Kernel Reset Register 0 */
    Ifx_ERAY_ACCEN1 ACCEN1;                 /**< \brief 8F8, Access Enable Register 1 */
    Ifx_ERAY_ACCEN0 ACCEN0;                 /**< \brief 8FC, Access Enable Register 0 */
    unsigned char reserved_900[1792];       /**< \brief 900, \internal Reserved */
} Ifx_ERAY;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXERAY_REGDEF_H */
